In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
##3. Write python code for indexing rows and columns based on the following conditions:Assume we have the following dataframe:
#data = {'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
#'age': [25, 35, 40, 28],
#'gender': ['F', 'M', 'M', 'M'],
#'salary': [50000, 70000, 60000, 80000]}df = pd.DataFrame(data)

data = {'name': ['Alice', 'Bob', 'Charlie', 'Dave'],'age': [25, 35, 40, 28],'gender': ['F', 'M', 'M', 'M'],'salary': [50000, 70000, 60000, 80000]}

In [4]:
data

{'name': ['Alice', 'Bob', 'Charlie', 'Dave'],
 'age': [25, 35, 40, 28],
 'gender': ['F', 'M', 'M', 'M'],
 'salary': [50000, 70000, 60000, 80000]}

In [7]:
df=pd.DataFrame(data)

In [8]:
df

      name  age gender  salary
0    Alice   25      F   50000
1      Bob   35      M   70000
2  Charlie   40      M   60000
3     Dave   28      M   80000

In [9]:
#a. Select rows where age is greater than 30:

age=df[df['age']>30]

In [10]:
age

      name  age gender  salary
1      Bob   35      M   70000
2  Charlie   40      M   60000

In [11]:
#b. Select rows where name contains 'e':
na=df[df['name'].str.contains('e')]

In [12]:
na

      name  age gender  salary
0    Alice   25      F   50000
2  Charlie   40      M   60000
3     Dave   28      M   80000

In [15]:
#c. Select rows where gender is 'M' and salary is greater than 65000:

gs=df[(df['gender']=='M')&(df['salary']>65000)]

In [16]:
gs

   name  age gender  salary
1   Bob   35      M   70000
3  Dave   28      M   80000

In [17]:
#d. Select columns 'name' and 'age'

so=df[['name','age']]

In [18]:
so

      name  age
0    Alice   25
1      Bob   35
2  Charlie   40
3     Dave   28